tiborsimon/embedded-tdd-headers/pic/pic12/pic12lf1822_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12LF1822_H_
#define _PIC12LF1822_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define PORTA_MDOUT                   36
#define C1INP                         37
#define AN0                           38
#define DACOUT                        39
#define RA0                           40
#define CPS0                          41
#define AN1                           42
#define SCL                           43
#define SRI                           44
#define RA1                           45
#define MDMIN                         46
#define SCK                           47
#define C1IN0N                        48
#define CPS1                          49
#define AN2                           50
#define SDI                           51
#define PORTA_C1OUT                   52
#define FLT0                          53
#define T0CKI                         54
#define SRQ                           55
#define RA2                           56
#define SDA                           57
#define MDCIN1                        58
#define CPS2                          59
#define RA3                           60
#define nMCLR                         61
#define CLKOUT                        62
#define AN3                           63
#define CLKR                          64
#define C1IN1N                        65
#define MDCIN2                        66
#define T1OSO                         67
#define RA4                           68
#define OSC2                          69
#define CPS3                          70
#define CLKIN                         71
#define T1CKI                         72
#define T1OSI                         73
#define OSC1                          74
#define RA5                           75
#define SRNQ                          76
#define PIR1                          77
#define TMR1IF                        78
#define TMR2IF                        79
#define CCP1IF                        80
#define SSP1IF                        81
#define TXIF                          82
#define RCIF                          83
#define ADIF                          84
#define TMR1GIF                       85
#define PIR2                          86
#define BCL1IF                        87
#define EEIF                          88
#define C1IF                          89
#define OSFIF                         90
#define TMR0                          91
#define TMR1L                         92
#define TMR1H                         93
#define T1CON                         94
#define TMR1ON                        95
#define nT1SYNC                       96
#define T1OSCEN                       97
#define T1CKPS0                       98
#define T1CKPS                        99
#define T1CKPS1                       100
#define TMR1CS                        101
#define TMR1CS0                       102
#define TMR1CS1                       103
#define T1GCON                        104
#define T1GSS0                        105
#define T1GSS                         106
#define T1GSS1                        107
#define T1GVAL                        108
#define T1GGO_nDONE                   109
#define T1GGO                         110
#define T1GSPM                        111
#define T1GTM                         112
#define T1GPOL                        113
#define TMR1GE                        114
#define TMR2                          115
#define PR2                           116
#define T2CON                         117
#define T2CKPS0                       118
#define T2CKPS                        119
#define T2CKPS1                       120
#define TMR2ON                        121
#define T2OUTPS0                      122
#define T2OUTPS                       123
#define T2OUTPS1                      124
#define T2OUTPS2                      125
#define T2OUTPS3                      126
#define CPSCON0                       127
#define T0XCS                         128
#define CPSOUT                        129
#define CPSRNG                        130
#define CPSRNG0                       131
#define CPSRNG1                       132
#define CPSRM                         133
#define CPSON                         134
#define CPSCON1                       135
#define CPSCH                         136
#define CPSCH0                        137
#define CPSCH1                        138
#define TRISA                         139
#define TRISA0                        140
#define TRISA1                        141
#define TRISA2                        142
#define TRISA3                        143
#define TRISA4                        144
#define TRISA5                        145
#define PIE1                          146
#define TMR1IE                        147
#define TMR2IE                        148
#define CCP1IE                        149
#define SSP1IE                        150
#define TXIE                          151
#define RCIE                          152
#define ADIE                          153
#define TMR1GIE                       154
#define PIE2                          155
#define BCL1IE                        156
#define EEIE                          157
#define C1IE                          158
#define OSFIE                         159
#define OPTION_REG                    160
#define PS                            161
#define PS0                           162
#define PS1                           163
#define PS2                           164
#define PSA                           165
#define T0SE                          166
#define TMR0SE                        167
#define T0CS                          168
#define TMR0CS                        169
#define INTEDG                        170
#define nWPUEN                        171
#define PCON                          172
#define nBOR                          173
#define nPOR                          174
#define nRI                           175
#define nRMCLR                        176
#define STKUNF                        177
#define STKOVF                        178
#define WDTCON                        179
#define SWDTEN                        180
#define WDTPS                         181
#define WDTPS0                        182
#define WDTPS1                        183
#define WDTPS2                        184
#define WDTPS3                        185
#define WDTPS4                        186
#define OSCTUNE                       187
#define TUN0                          188
#define TUN                           189
#define TUN1                          190
#define TUN2                          191
#define TUN3                          192
#define TUN4                          193
#define TUN5                          194
#define OSCCON                        195
#define SCS0                          196
#define SCS                           197
#define SCS1                          198
#define IRCF                          199
#define IRCF0                         200
#define IRCF1                         201
#define IRCF2                         202
#define IRCF3                         203
#define SPLLEN                        204
#define OSCSTAT                       205
#define HFIOFS                        206
#define LFIOFR                        207
#define MFIOFR                        208
#define HFIOFL                        209
#define HFIOFR                        210
#define OSTS                          211
#define PLLR                          212
#define T1OSCR                        213
#define ADRESL                        214
#define ADRESH                        215
#define ADCON0                        216
#define ADON                          217
#define nDONE                         218
#define GO_nDONE                      219
#define GO                            220
#define ADGO                          221
#define CHS0                          222
#define CHS                           223
#define CHS1                          224
#define CHS2                          225
#define CHS3                          226
#define CHS4                          227
#define ADCON1                        228
#define ADPREF0                       229
#define ADPREF                        230
#define ADPREF1                       231
#define ADCS0                         232
#define ADCS                          233
#define ADCS1                         234
#define ADCS2                         235
#define ADFM                          236
#define LATA                          237
#define LATA0                         238
#define LATA1                         239
#define LATA2                         240
#define LATA4                         241
#define LATA5                         242
#define CM1CON0                       243
#define C1SYNC                        244
#define C1HYS                         245
#define C1SP                          246
#define C1POL                         247
#define C1OE                          248
#define CM1CON0_C1OUT                 249
#define C1ON                          250
#define CM1CON1                       251
#define C1NCH0                        252
#define C1PCH                         253
#define C1PCH0                        254
#define C1PCH1                        255
#define C1INTN                        256
#define C1INTP                        257
#define CMOUT                         258
#define MC1OUT                        259
#define BORCON                        260
#define BORRDY                        261
#define SBOREN                        262
#define FVRCON                        263
#define ADFVR0                        264
#define ADFVR                         265
#define ADFVR1                        266
#define CDAFVR0                       267
#define CDAFVR                        268
#define CDAFVR1                       269
#define TSRNG                         270
#define TSEN                          271
#define FVRRDY                        272
#define FVREN                         273
#define DACCON0                       274
#define DACPSS                        275
#define DACPSS0                       276
#define DACPSS1                       277
#define DACOE                         278
#define DACLPS                        279
#define DACEN                         280
#define DACCON1                       281
#define DACR0                         282
#define DACR                          283
#define DACR1                         284
#define DACR2                         285
#define DACR3                         286
#define DACR4                         287
#define SRCON0                        288
#define SRPR                          289
#define SRPS                          290
#define SRNQEN                        291
#define SRQEN                         292
#define SRCLK0                        293
#define SRCLK                         294
#define SRCLK1                        295
#define SRCLK2                        296
#define SRLEN                         297
#define SRCON1                        298
#define SRRC1E                        299
#define SRRCKE                        300
#define SRRPE                         301
#define SRSC1E                        302
#define SRSCKE                        303
#define SRSPE                         304
#define APFCON                        305
#define CCP1SEL                       306
#define P1BSEL                        307
#define TXCKSEL                       308
#define T1GSEL                        309
#define SSSEL                         310
#define SS1SEL                        311
#define SDO1SEL                       312
#define SDOSEL                        313
#define RXDTSEL                       314
#define ANSA0                         315
#define ANSELA                        316
#define ANSA1                         317
#define ANSA2                         318
#define ANSA4                         319
#define EEADRL                        320
#define EEADRH                        321
#define EEDATL                        322
#define EEDATH                        323
#define EECON1                        324
#define RD                            325
#define WR                            326
#define WREN                          327
#define WRERR                         328
#define FREE                          329
#define LWLO                          330
#define CFGS                          331
#define EEPGD                         332
#define EECON2                        333
#define RCREG                         334
#define TXREG                         335
#define SP1BRGL                       336
#define SPBRGL                        337
#define SP1BRGH                       338
#define SPBRGH                        339
#define RCSTA                         340
#define RX9D                          341
#define OERR                          342
#define FERR                          343
#define ADDEN                         344
#define CREN                          345
#define SREN                          346
#define RX9                           347
#define SPEN                          348
#define TXSTA                         349
#define TX9D                          350
#define TRMT                          351
#define BRGH                          352
#define SENDB                         353
#define SYNC                          354
#define TXEN                          355
#define TX9                           356
#define CSRC                          357
#define BAUDCON                       358
#define ABDEN                         359
#define WUE                           360
#define BRG16                         361
#define SCKP                          362
#define RCIDL                         363
#define ABDOVF                        364
#define WPUA0                         365
#define WPUA                          366
#define WPUA1                         367
#define WPUA2                         368
#define WPUA3                         369
#define WPUA4                         370
#define WPUA5                         371
#define SSP1BUF                       372
#define SSPBUF                        373
#define SSP1ADD                       374
#define SSPADD                        375
#define SSP1MSK                       376
#define SSPMSK                        377
#define SSP1STAT                      378
#define BF                            379
#define UA                            380
#define R_nW                          381
#define S                             382
#define P                             383
#define D_nA                          384
#define CKE                           385
#define SMP                           386
#define SSP1CON1                      387
#define SSPM0                         388
#define SSPM                          389
#define SSPM1                         390
#define SSPM2                         391
#define SSPM3                         392
#define CKP                           393
#define SSPEN                         394
#define SSPOV                         395
#define WCOL                          396
#define SSP1CON2                      397
#define SEN                           398
#define RSEN                          399
#define PEN                           400
#define RCEN                          401
#define ACKEN                         402
#define ACKDT                         403
#define ACKSTAT                       404
#define GCEN                          405
#define SSP1CON3                      406
#define DHEN                          407
#define AHEN                          408
#define SBCDE                         409
#define SDAHT                         410
#define BOEN                          411
#define SCIE                          412
#define PCIE                          413
#define ACKTIM                        414
#define CCPR1L                        415
#define CCPR1H                        416
#define CCP1CON                       417
#define CCP1M0                        418
#define CCP1M                         419
#define CCP1M1                        420
#define CCP1M2                        421
#define CCP1M3                        422
#define DC1B                          423
#define DC1B0                         424
#define DC1B1                         425
#define P1M                           426
#define P1M0                          427
#define P1M1                          428
#define PWM1CON                       429
#define P1DC                          430
#define P1DC0                         431
#define P1DC1                         432
#define P1DC2                         433
#define P1DC3                         434
#define P1DC4                         435
#define P1DC5                         436
#define P1DC6                         437
#define P1RSEN                        438
#define PSS1BD                        439
#define PSS1BD0                       440
#define PSS1BD1                       441
#define PSS1AC                        442
#define PSS1AC0                       443
#define PSS1AC1                       444
#define CCP1AS                        445
#define CCP1AS0                       446
#define CCP1AS1                       447
#define CCP1AS2                       448
#define CCP1ASE                       449
#define PSTR1CON                      450
#define STR1A                         451
#define STR1B                         452
#define STR1C                         453
#define STR1D                         454
#define STR1SYNC                      455
#define IOCAP                         456
#define IOCAP0                        457
#define IOCAP1                        458
#define IOCAP2                        459
#define IOCAP3                        460
#define IOCAP4                        461
#define IOCAP5                        462
#define IOCAN0                        463
#define IOCAN                         464
#define IOCAN1                        465
#define IOCAN2                        466
#define IOCAN3                        467
#define IOCAN4                        468
#define IOCAN5                        469
#define IOCAF0                        470
#define IOCAF                         471
#define IOCAF1                        472
#define IOCAF2                        473
#define IOCAF3                        474
#define IOCAF4                        475
#define IOCAF5                        476
#define CLKRCON                       477
#define CLKRDIV                       478
#define CLKRDIV0                      479
#define CLKRDIV1                      480
#define CLKRDIV2                      481
#define CLKRDC                        482
#define CLKRDC0                       483
#define CLKRDC1                       484
#define CLKRSLR                       485
#define CLKROE                        486
#define CLKREN                        487
#define MDCON                         488
#define MDBIT                         489
#define MDCON_MDOUT                   490
#define MDOPOL                        491
#define MDSLR                         492
#define MDOE                          493
#define MDEN                          494
#define MDSRC                         495
#define MDMS0                         496
#define MDMS                          497
#define MDMS1                         498
#define MDMS2                         499
#define MDMS3                         500
#define MDMSODIS                      501
#define MDCARL                        502
#define MDCL0                         503
#define MDCL                          504
#define MDCL1                         505
#define MDCL2                         506
#define MDCL3                         507
#define MDCLSYNC                      508
#define MDCLPOL                       509
#define MDCLODIS                      510
#define MDCARH                        511
#define MDCH                          512
#define MDCH0                         513
#define MDCH1                         514
#define MDCH2                         515
#define MDCH3                         516
#define MDCHSYNC                      517
#define MDCHPOL                       518
#define MDCHODIS                      519
#define STATUS_SHAD                   520
#define C_SHAD                        521
#define DC_SHAD                       522
#define Z_SHAD                        523
#define WREG_SHAD                     524
#define BSR_SHAD                      525
#define PCLATH_SHAD                   526
#define FSR0L_SHAD                    527
#define FSR0H_SHAD                    528
#define FSR1L_SHAD                    529
#define FSR1H_SHAD                    530
#define STKPTR                        531
#define TOSL                          532
#define TOSH                          533

#endif // _PIC12LF1822_H_
